ERP/src/Documents/Подписка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>Подписка</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДвижениеПодписчиков</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагент</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникПодписки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИсточникПодписки</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Реферал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Промокод</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПромокодСтрока</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Тариф</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусПодписки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазоваяСтоимость</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСредства</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРегулярногоПлатежа</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСредства</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Обновления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументОбновления</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ОбновлениеПодписки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОбновления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ERP/src/CommonModules/КсенонОтвет/Ext/Module.bsl
Функция Процент()

	Возврат "%";
	
КонецФункции

Функция Рубль()

	Возврат "₽";
	
КонецФункции

Функция ПрайсЛистПоПромокоду(ДанныеПромокода, ПромокодСтрока) Экспорт
		
	Если ТипЗнч(ДанныеПромокода.ИсточникПодписки) = Тип("ДокументСсылка.ПерсональныйПромокод") Тогда
		Тип = "personal";	
	ИначеЕсли ТипЗнч(ДанныеПромокода.ИсточникПодписки) = Тип("ДокументСсылка.ПартнерскаяКомпания") Тогда
		Тип = "partner";
	Иначе
		ВызватьИсключение "Необходимо установить представление для данного документа!";
	КонецЕсли;
	ИсточникРегистратор = Новый Структура("type,guid", Тип, ОбщегоНазначения.ПолучитьУИД(ДанныеПромокода.ИсточникПодписки));
	ИнформацияОРеферале = Новый Структура("promo_code,refer_guid,recorder", ПромокодСтрока, ОбщегоНазначения.ПолучитьУИД(ДанныеПромокода.Реферал), ИсточникРегистратор);
	
	Результат = ПрайсЛист(ДанныеПромокода.ПрайсЛист, ИнформацияОРеферале);
	
	Возврат Результат;
	
КонецФункции

Функция ПрайсЛист(ПрайсЛистОбъект, ИнформацияОРеферале=Неопределено) Экспорт
	
	ЭлементыПрайсЛиста = Новый Массив;
	
	Для Каждого ТарифСтрока Из ПрайсЛистОбъект.Тарифы Цикл
		
		ЭлементыПрайсЛиста.Добавить(Новый Структура("title,tariff_guid,price,discount,amount,source_info",
			ТарифСтрока.Тариф.НаименованиеДляБота, ОбщегоНазначения.ПолучитьУИД(ТарифСтрока.Тариф), ЕдиницаИзмерения(ТарифСтрока.Стоимость, Рубль()),
			ЕдиницаИзмерения(ТарифСтрока.Скидка, Процент(), 2, "per"), ЕдиницаИзмерения(ТарифСтрока.Сумма, Рубль()), ИнформацияОРеферале));	
		
	КонецЦикла;		
	
	Возврат Новый Структура("price_items", ЭлементыПрайсЛиста);
	
КонецФункции

Функция ЕдиницаИзмерения(Значение, СимволИзмерения, Разряды=2, Измерение="rub")
	
	Возврат Новый Структура("value,unit_symbol,semicolons,currency", Значение * Pow(10, Разряды), СимволИзмерения, Разряды, Измерение);	
	
КонецФункции

Функция НовыйСчет(ТелеграмИД, ДанныеВыбранногоТарифа)
	
	НоваяПодписка = Документы.Подписка.СоздатьДокумент();
	НоваяПодписка.Клиент = Неопределено;
	//НоваяПодписка.ИсточникПодписки = ПолучитьОбъектИзУИД("Документ", );
	НоваяПодписка.Реферал = Неопределено;
	НоваяПодписка.Промокод = Неопределено;
	НоваяПодписка.Тариф = Неопределено;
	НоваяПодписка.БазоваяСтоимость = Неопределено;
	НоваяПодписка.СуммаРегулярногоПлатежа = Неопределено;
	
КонецФункции
